Revit 2027 API
MacroManager.GetEnumerator Method
Returns an enumerator that iterates through a collection.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<MacroModule> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of MacroModule)
public:
virtual IEnumerator<MacroModule^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<MacroModule>
override GetEnumerator : unit -> IEnumerator<MacroModule>
Return Value
IEnumerator<MacroModule>
An IEnumerator object that can be used to iterate through the collection.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace